# CannotFinishGroupInSketchMode Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..GroupFailures..::..CannotFinishGroupInSketchMode Property
BuiltInFailures..::..GroupFailures Class See Also
---
Can't Finish Group while in Sketch Mode.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotFinishGroupInSketchMode { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotFinishGroupInSketchMode As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotFinishGroupInSketchMode {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..GroupFailures Class
Autodesk.Revit.DB Namespace